import React from 'react'
import { useState } from 'react'
import ApplicationPost from './ApplicationPost'

function MainLabel() {
   //const dataSet = JSON.parse('../assets/data.json') 
    const [posts, setPosts] = useState( [

        {
            "INN": 6123003612,
            "Name": "МБУЗ ЦРБ НЕКЛИНОВСКОГО РАЙОНА РОСТОВСКОЙ ОБЛАСТИ (МУЗ ЦЕНТРАЛЬНАЯ РАЙОННАЯ БОЛЬНИЦА)",
            "id": 28793251,
            "StatusHistory": ["Закрыт(отказ клиента)"],
            "DateHistory": ["08.12.2022"]
    
        },  
          
        {
              
            "INN": 6101032673,
            "Name": "ООО ДОНТЕРМИНАЛ",
            "id": 28911042,
            "StatusHistory": ["Закрыт (отказ клиента)"],
            "DateHistory": ["14.12.2022"] 
        },
    
        {
            "INN": 6154077452,
            "Name": "ООО НАСЛЕДИЕ",
            "id": 29820714,
            "StatusHistory": ["Удалена (ошибка ввода)"],
            "DateHistory": ["25.01.2023"] 
        },
    
        {
            "INN": 6148555936,
            "Name": "АДМИНИСТРАЦИЯ КИСЕЛЕВСКОГО СЕЛЬСКОГО ПОСЕЛЕНИЯ",
            "id": 31177317,
            "StatusHistory": ["Удалена (абонент уже подключен)"],
            "DateHistory": ["06.02.2023"] 
        },
    
        {
            "INN": 6136009668,
            "Name": "ООО СТРОЙЭЛЕКТРОБЫТ",
            "id": 32447309,
            "StatusHistory": ["Закрыт"],
            "DateHistory": ["27.02.2023"] 
        },
    
        {
            "INN": 6135007474,
            "Name": "ГБУСОН РО УСТЬ-ДОНЕЦКИЙ ДИПИ",
            "id": 33964957,
            "StatusHistory": ["Удалена (абонент уже подключен)"],
            "DateHistory": ["19.01.2023"] 
        },
    
        {
            "INN": 6127011124,
            "Name": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ ЛЕКТОР",
            "id": 35401503,
            "StatusHistory": ["Создание договоров", "Тест", "Закрыт"],
            "DateHistory": ["27.02.2023", "28.02.2023", "02.03.2023"] 
        },
    
        {
            "INN": 6155040180,
            "Name": "МДОУ ДЕТСКИЙ САД№ 36 ОБЩЕРАЗВИВАЮЩЕГО ВИДА 2 КАТЕГОРИИ Г.ШАХТЫ РОСТОВСКОЙ ОБЛАСТИ",
            "id": 37551446,
            "StatusHistory": ["Тест"],
            "DateHistory": ["02.02.2023"] 
        },
    
        {
            "INN": 9204005780,
            "Name": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ ДДОС-ГВАРД",
            "id": 38021796,
            "StatusHistory": ["Отложена (нет тех. возможности)", "Закрыт (не удалось связаться с клиентом)"],
            "DateHistory": ["28.12.2022", "29.12.2022"] 
        },
    
        {
            "INN": 6163053715,
            "Name": "МИНИСТЕРСТВО ТРАНСПОРТА РОСТОВСКОЙ ОБЛАСТИ",
            "id": 50393296,
            "StatusHistory": ["Назначено тех. обследование"],
            "DateHistory": ["30.01.2023"] 
        },
    
        {
            "INN": 104016125,
            "Name": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ ВЕРШИНА",
            "id": 50445284,
            "StatusHistory": ["В работе", "Закрыт (отказ клиента)"],
            "DateHistory": ["01.12.2022", "04.12.2022"] 
        },
    
        {
            "INN": 4714004270,
            "Name": "ФЕДЕРАЛЬНОЕ ГОСУДАРСТВЕННОЕ УНИТАРНОЕ ПРЕДПРИЯТИЕ ФЕДЕРАЛЬНЫЙ ЭКОЛОГИЧЕСКИЙ ОПЕРАТОР",
            "id": 50452409,
            "StatusHistory": ["Заведение заявки"],
            "DateHistory": ["15.12.2022"] 
        },
    
        {
            "INN": 6143052093,
            "Name": "МЕСТНАЯ РЕЛИГИОЗНАЯ ОРГАНИЗАЦИЯ ПРАВОСЛАВНЫЙ ПРИХОД ХРАМА РОЖДЕСТВА ХРИСТОВА Г.ВОЛГОДОНСКА",
            "id": 50455006,
            "StatusHistory": ["Обработка в СУС", "Тест", "Закрыт (нет тех. Возможности)"],
            "DateHistory": ["01.12.2022","03.12.2022","05.12.2022"] 
        },
        {
            "INN": 6112914998,
            "Name": "МУНИЦИПАЛЬНОЕ БЮДЖЕТНОЕ ДОШКОЛЬНОЕ ОБРАЗОВАТЕЛЬНОЕ УЧРЕЖДЕНИЕ ДЕТСКИЙ САД <<ВИШЕНКА>>",
            "id": 50721058,
            "StatusHistory": ["Создание договоров"],
            "DateHistory": ["10.01.2023"]
        },
        {
            "INN": 6107008003,
            "Name": "ООО <<АЛЬФА>>",
            "id": 19683113,
            "StatusHistory": ["Удалена (ошибка ввода)"],
            "DateHistory": ["15.12.2022"]
        },
        {
            "INN": 7707083893,
            "Name": "ПАО СБЕРБАНК",
            "id": 23276429,
            "StatusHistory": ["Закрыт (нет тех. возможности)"],
            "DateHistory": ["27.01.2023"]
        },
        {
            "INN": 7717127211,
            "Name": "ФГУП <<РТРС>>",
            "id": 23504090,
            "StatusHistory": ["Создание договоров", "Закрыта(отказ клиента)"],
            "DateHistory": ["03.02.2023", "05.03.2023"]
        },
        {
            "INN": 6135006625,
            "Name": "ООО <<МЕЛИХОВСКОЕ АГРО>> ",
            "id": 23549294,
            "StatusHistory": ["Удалена (ошибка ввода)"],
            "DateHistory": ["21.12.2022"]
        },
        {
            "INN": 6166006390,
            "Name": "ООО ЭНЕРГОСБЕРЕГАЮЩИЙ СОЮЗ ЮГ",
            "id": 23706989,
            "StatusHistory": ["Закрыт (нет тех. возможности)"],
            "DateHistory": ["10.01.2023"]
        },
        {
            "INN": 3442050010,
            "Name": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ <<ТАМЕРЛАН>> ",
            "id": 23734565,
            "StatusHistory": ["Удалена (ошибка ввода)"],
            "DateHistory": ["11.01.2023"]
        },
        {
            "INN": 6101000657,
            "Name": "САМАРСКОЕ ПО ",
            "id": 30606019,
            "StatusHistory": ["Удалена (ошибка ввода)"],
            "DateHistory": ["25.03.2023"]
        },
        {
            "INN": 7701616048,
            "Name": "ООО <<НЬЮС МЕДИА>>",
            "id": 30778220,
            "StatusHistory": ["Тест", "Создание договоров", "Закрыта"],
            "DateHistory": ["03.03.2023", "05.03.2023", "06.03.2023"]
        },
        {
            "INN": 263600443740,
            "Name": "ИП ГАЛЕТОВ С.В.",
            "id": 50740443,
            "StatusHistory": ["Обработка в СУС"],
            "DateHistory": ["29.12.2022"]
        },
        {
            "INN": 6165074414,
            "Name": "РОСТОВОБЛГОСТЕХНАДЗОР",
            "id": 50742895,
            "StatusHistory": ["Обработка в СУС"],
            "DateHistory": ["30.12.2022"]
        },
        {
            "INN": 6168092242,
            "Name": "ЮГТЕЛЕКОМ",
            "id": 50743236,
            "StatusHistory": ["В работе"],
            "DateHistory": ["30.12.2022"]
        },
        {
            "INN": 6164135079,
            "Name": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ <<ИМПЕРИЯ>> ",
            "id": 50743515,
            "StatusHistory": ["В работе"],
            "DateHistory": ["30.12.2022"]
        },
        {
            "INN": 6167103646,
            "Name": "ООО УК <<НАХИЧЕВАНЬ>>",
            "id": 50738733,
            "StatusHistory": ["Закрыта"],
            "DateHistory": ["12.01.2021"]
        },
        {
            "INN": 615146223848,
            "Name": "ИП СЕМЕНОВ ДАВИД НИКОЛАЕВИЧ",
            "id": 50743843,
            "StatusHistory": ["Обработка в СУС", "Отложена(нет тех. возможности", "Закрыта(нет тех. возможности)"],
            "DateHistory": ["30.12.2022", "13.01.2023", "15.03.2023"]
        },
        {
            "INN": 615522664654,
            "Name": "ИП ФАРХАД ГЕОРГИЙ ГАЙКОВИЧ",
            "id": 50744230,
            "StatusHistory": ["В работе"],
            "DateHistory": ["30.12.2022"]
        },
        {
            "INN": 6165180885,
            "Name": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ <<МЕДИЦИНСКИЕ ТЕХНОЛОГИИ>>",
            "id": 50744474,
            "StatusHistory": ["В работе", "Не подтверждена", "Закрыт(не удалось связаться с клиентом)"],
            "DateHistory": ["30.12.2022", "16.01.2023", "02.02.2023"]
        },
        {
            "INN": 7719247056,
            "Name": "ООО <<Д С БАРС>>",
            "id": 50744409,
            "StatusHistory": ["Закрыт (отказ клиента)"],
            "DateHistory": ["13.01.2023"]
        },
        {
            "INN": 6165200517,
            "Name": "ООО <<ПРОНЕДВИЖИМОСТЬ>>",
            "id": 50724389,
            "StatusHistory": ["Создание договоров"],
            "DateHistory": ["30.12.2022"]
        },
        {
            "INN": 6150010834,
            "Name": "ФЕДЕРАЛЬНОЕ ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ ОБРАЗОВАТЕЛЬНОЕ УЧРЕЖДЕНИЕ ВЫСШЕГО ОБРАЗОВАНИЯ <<ЮЖНО-РОССИЙСКИЙ ГОСУДАРСТВЕННЫЙ ПОЛИТЕХНИЧЕСКИЙ УНИВЕРСИТЕТ (НПИ) ИМЕНИ М.И. ПЛАТОВА>>",
            "id": 50744391,
            "StatusHistory": ["Удалена (ошибка ввода)"],
            "DateHistory": ["12.01.2023"]
        },
        {
            "INN": 6114010236,
            "Name": "МУК <<ГУСЕВСКИЙ ЦПСДК>> ",
            "id": 50748088,
            "StatusHistory": ["В работе", "Отложена по просьбе клиента", "Закрыта(отказ клиента)"],
            "DateHistory": ["30.12.2022", "08.01.2023", "11.01.2023"]
        },
        {
            "INN": 6113023296,
            "Name": "ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ <<ДАЧА ХАУС>> ",
            "id": 50811995,
            "StatusHistory": ["Обработка в СУС"],
            "DateHistory": ["09.01.2023"]
        },
        {
            "INN": 616841611308,
            "Name": "ИП МАМЕДОВ НАТИГ ЛЯТИФ ОГЛЫ",
            "id": 50814007,
            "StatusHistory": ["Обработка в СУС"],
            "DateHistory": ["13.01.2023"]
        },
        {
            "INN": 611900555730,
            "Name": "ИП Лихота А.Г.",
            "id": 50815293,
            "StatusHistory": ["В работе"],
            "DateHistory": ["09.01.2023"]
        },
        {
            "INN": 6107009938,
            "Name": "МУНИЦИПАЛЬНОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ <<УПРАВЛЕНИЕ ПО ДЕЛАМ ГРАЖДАНСКОЙ ОБОРОНЫ И ЧРЕЗВЫЧАЙНЫМ СИТУАЦИЯМ ВОЛГОДОНСКОГО РАЙОНА РОСТОВСКОЙ ОБЛАСТИ>>",
            "id": 50819269,
            "StatusHistory": ["Закрыт (нет тех. возможности)"],
            "DateHistory": ["10.01.2023"]
        }
    ]
    )
  return (
    <div className='APP'>
        {posts.map((post) => 
                <ApplicationPost post = {post} key = {post.id}/>
        )}
    </div>
  )
}

export default MainLabel